# FabricationHangerOutOfHost Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabricationHangerOutOfHost Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
The hanger is out of its host and will be disconnected.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricationHangerOutOfHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationHangerOutOfHost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricationHangerOutOfHost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace